In [38]:
import pandas as pd
import numpy as np
from datetime import datetime

## 1、将Numpy array转化为Pandas Series
例：

NumPy array:
[10 20 30 40 50]
转化后的Pandas series:
0 10
1 20
2 30
3 40
4 50
dtype: int64

In [4]:
arr = pd.Series([10,20,30,40,50])
arr

0    10
1    20
2    30
3    40
4    50
dtype: int64

## 2、使用字典创建Pandas Series

例：

原dictionary:

{'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
转化后的series:
a 100
b 200
c 300
d 400
e 800
dtype: int64

In [6]:
arr_1 = pd.Series({'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800})
arr_1

a    100
b    200
c    300
d    400
e    800
dtype: int64

## 3、用Pandas从字典创建一个DataFrame，有指定索引，并切片其中3-6行数据

字典：exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
索引：labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [18]:
df = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}, index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
df.loc['c':'f',:]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes

4、Series索引

切片以下序列的子集

原始序列 Data Series:
0 0
1 1
2 2
3 3
4 4
5 5
6 6
7 7
8 8
9 9
10 10
dtype: int64
切片后 Data Series:
0 0
1 1
2 2
3 3
4 4
5 5
dtype: int64

In [23]:
array = [0,0,1,1,2,2,3,3,4,4,5,5,6,6,7,7,8,8,9,9,10,10]
arr_4 = pd.Series(array)
arr_4[0:12]

0     0
1     0
2     1
3     1
4     2
5     2
6     3
7     3
8     4
9     4
10    5
11    5
dtype: int64

5、更改序列索引

原始 Data Series:
A 1
B 2
C 3
D 4
E 5
dtype: int64

更改后  Data Series:

B 2
A 1
C 3
D 4
E 5
dtype: int64

In [34]:
pd1 = pd.Series([1,2,3,4,5],index=['A','B','C','D','E'])
pd1.index=['B','A','C','D','E']
pd1

B    1
A    2
C    3
D    4
E    5
dtype: int64

6、创建有2个时间索引值和一列随机数的时间序列

索引取值为2011-09-01和2011-09-02，取值为0-1间正态分布随机数

In [41]:
num = pd.DataFrame(np.random.random(2),index=['2011-09-01','2011-09-02'],columns=['a'])
num

                   a
2011-09-01  0.744465
2011-09-02  0.389324

7、创建从2011-01-01起，36个月内，时间间隔为3个月的序列，并切片该时间序列中间时间点数据

In [64]:
times=pd.date_range('20110101',periods=36, freq='3M')
time_1 = pd.DataFrame(np.random.random(36),index=times,columns=['time'])
time_1.iloc[18,:]

time    0.196023
Name: 2015-07-31 00:00:00, dtype: float64

8、对DataFrame的列进行重命名：

原DataFrame：

col1 col2 col3
0 1 4 7
1 2 5 8
2 3 6 9

重命名后：

Column1 Column2 Column3
0 1 4 7
1 2 5 8
2 3 6 9

In [73]:
df1 = pd.DataFrame([[0,1,4,7],[1,2,5,8],[2,3,6,9]],index=['col1','col2','col3'])
df1.index=['Column1','Column2','Column3']
df1

         0  1  2  3
Column1  0  1  4  7
Column2  1  2  5  8
Column3  2  3  6  9

9、向DataFrame添加数据：

原DataFrame：

col1 col2 col3
0 1 4 7
1 4 5 8
2 3 6 9
3 4 7 0
4 5 8 1

增加数据后：

col1 col2 col3
0 1 4 7
1 4 5 8
2 3 6 9
3 4 7 0
4 5 8 1
5 10 11 12

In [79]:
df2 = pd.DataFrame([[0,1,4,7],[1,2,5,8],[2,3,6,9]],index=['col1','col2','col3'])
row=[5,10,11,12]
df2.loc[0]=row
df2

      0   1   2   3
col1  0   1   4   7
col2  1   2   5   8
col3  2   3   6   9
0     5  10  11  12

10、筛选col3取值大于5的记录：

原DataFrame：

col1 col2 col3
0 1 4 7
1 2 5 8
2 3 6 12
3 4 9 1
4 7 5 11

In [109]:
df3 = pd.DataFrame([[0,1,4,7],[1,2,5,8],[2,3,6,12],[3,4,9,1],[4,7,5,11]],columns=['col1','col2','col3','col4'])
df4 = df3[df3['col3']>5]
df4

   col1  col2  col3  col4
2     2     3     6    12
3     3     4     9     1